{
  "id": 372058,
  "page": 1,
  "results": [
    {
      "author": "Gimly",
      "author_details": {
        "name": "Gimly",
        "username": "Ruuz",
        "avatar_path": "/xUObnJSvHrFPsIpoDmb1jiQZLq7.jpg",
        "rating": 4.0
      },
      "content": "I would never take it away from anyone, but I was underwhelmed.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._",
      "created_at": "2017-02-06T07:41:01.665Z",
      "id": "5898288d9251417a85005c47",
      "updated_at": "2017-02-06T15:54:41.178Z",
      "url": "https://www.themoviedb.org/review/5898288d9251417a85005c47"
    },
    {
      "author": "BecauseImBatman",
      "author_details": {
        "name": "",
        "username": "BecauseImBatman",
        "avatar_path": "/lTML4AY3S478MWH8uHKx1FV0h46.jpg",
        "rating": 8.0
      },
      "content": "It has beautiful animation and beautiful characters. It is a funny, sweet and emotional roller coaster of a crowd-pleaser that manages to win your heart.",
      "created_at": "2017-02-24T05:50:57.441Z",
      "id": "58afc9c1c3a3682cd0007c1a",
      "updated_at": "2017-02-24T05:59:08.009Z",
      "url": "https://www.themoviedb.org/review/58afc9c1c3a3682cd0007c1a"
    },
    {
      "author": "Reno",
      "author_details": {
        "name": "Reno",
        "username": "Rangan",
        "avatar_path": "/6ZpVUJzqXMzH35VprEtnX0sNI3.jpg",
        "rating": 8.0
      },
      "content": "**They're no strangers, yet they've never met.**\r\n\r\nProbably the most anticipated anime since the final film of Mr. Miyazaki. Because people know what these guys are capable of. This is one per cent sci-fi and 99 per cent fantasy. The concept is not new for us. From 'Freaky Friday' to 'The Lake House', even the recent American television film 'The Swap', you will remember a handful of names once you read this film's synopsis. Yet the film was so good, because of how well the theme was utilised.\r\n\r\nWe all know the technical brilliance of '5 Centimeters Per Second' and the beautiful romance from 'The Garden of Words'. This is an excellent mix of those two. If love either of them, or both, then you will love it as well. But if you ask me, my favourite is still 'The Garden of Words' from this director. I liked this film, enjoyed thoroughly, so liking it less than that means not a bad flick. Surely a film to recommend for anime fans, as well as for animation's (western audience).\r\n\r\nThe story of two teenagers, one from the rural Japan mountain region and the other one from Tokyo. The plot revolves around a comet that is to pass by very close to the earth. But before that event, the girl is bored with her life, so she dreams of living in a big city and that too as a boy. One day her wish comes true when she wakes up as she swapped bodies, including most of the memories with a boy from Tokyo.\r\n\r\nFor her, it is to live as she wanted and make use of the opportunity. But for him, it is like a curse, hence becomes rebellious. This thing keeps happening frequently for days and weeks. After some times, realising the phenomena is between two, they make a deal and strict order of Dos and Don'ts while away. All this until the day of comet and everything changes forever. Searching for the truth and the result of it leads to the end of the tale.\r\n\r\n> ❝Treasure the experience. Dreams fade away after you wake up.❞\r\n\r\nUnlike Miyazaki, Makot Shinkai's storytelling is quite for the matured audience. It targets adults more than the children. Particularly for not shying away to include naturally occurring events in such situation as the story develops, despite/even though the film revolves around the teens/kids. As for this flick, the concern is not big, but it depends on the nation and its culture you belong to. It is very much acceptable and as the story progress, the best things keep replacing another till the finale. So hooked to it is assured.\r\n\r\nThe film length was good and so the pace of the narration. Well written screenplay, which was based on the book of the same name. But the director admits the inspiration from the previous flicks with similar themes. They have used the real places of the anime version with fictional names, but most of the Tokyo remains same and they all were awesome.\r\n\r\nIn many scenes, the camera panning was a treat. Especially the framerate was high, so no jerks, hence very pleasurable visual experience. Like I mentioned earlier, this is a unique film, despite not a original idea. The film proved the Japan is not overshadowed by Hollywood, particularly after the decline of animes in the recent years. It's up to the quality of the product, if so, then those glory days can be brought back for animes. Anyway, now this film holds the record for highest grossed anime.\r\n\r\nApart from technical dominance, the story is also enchanting. If you like romance theme, this will serve you well. A good film for date night. But usually people would skip animation for such occasion and one should not mix up that with anime. Because why I always put apart the anime and animation is, the animes are good at beautiful romance, while its counterpart from the west focus more on comedy and adventure. But the common thing from them is the well explored fantasy theme.\r\n\r\nUsually the ends are guessable for a film like this and the same case for this in here. Only as a result of the story, you would know what's coming, but not the frame by frame scenes of it. Yeah, I liked this conclusion, the final lines said might bring you tears in your eyes, romantically, if you are an emotional person. One of the best endings, even though it was clichéd. And the credits start to roll up, while you begin to recall everything you just saw in the last 100 minutes. A must see film, so highly recommended by my side. Now I've to wait for another couple of years for such film.\r\n\r\n_8/10_",
      "created_at": "2017-04-26T23:04:45.641Z",
      "id": "5901278dc3a36810c600301c",
      "updated_at": "2017-04-27T03:08:16.081Z",
      "url": "https://www.themoviedb.org/review/5901278dc3a36810c600301c"
    },
    {
      "author": "r96sk",
      "author_details": {
        "name": "",
        "username": "r96sk",
        "avatar_path": "/https://secure.gravatar.com/avatar/96c2e0e4ac98450f9e8e3c0a0a40aad8.jpg",
        "rating": 10.0
      },
      "content": "An absolutely stunning film!\r\n\r\nThere is nothing to even marginally dislike about <em>'Your Name'</em>. The animation is sensational, breathtaking in fact. The amount of detail, particularly in Tokyo, is insane. It's utterly gorgeous to watch.\r\n\r\nThen you have the magnificent story, which is filled to the brim with feeling and meaning. I felt everything that it intended me to. It's also paced to perfection and is told through two memorable characters in Taki (Ryūnosuke Kamiki) and Mitsuha (Mone Kamishiraishi).\r\n\r\nKamiki and Kamishiraishi are excellent in the lead roles. Of course I don't understand Japanese and was using subtitles, yet I still felt every intended emotion from those two. Class from them. Of the others, Ms. Okudera (Masami Nagasawa) is the one that sticks out most to me.\r\n\r\nIf all that wasn't enough, you even have a tremendous soundtrack and score to boot. It really does all make for a fantastic viewing experience, one I will be revisiting no doubt and one I would undoubtedly recommend.",
      "created_at": "2021-03-06T23:22:30.289Z",
      "id": "60440eb670b444005a28c33e",
      "updated_at": "2021-03-06T23:22:30.289Z",
      "url": "https://www.themoviedb.org/review/60440eb670b444005a28c33e"
    }
  ],
  "total_pages": 1,
  "total_results": 4
}
